package ru.job4j.basics.console;

/*
  Напишите класс, который выводит на экран надпись

  H-e-l-l-o-,-f-r-i-e-n-d!

  без перевода на новую строку.
*/
public class Task14 {
    public static void main(String[] args) {
        System.out.print("H-e-l-l-o-,-f-r-i-e-n-d!");
    }
}
